БухЭксп/InformationRegisters/CW_ВерсииПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ВерсииПодсистем</Name>
			<Comment>Версии этой конфигурации и родительских конфигураций на поддержке</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ВерсииПодсистемСервер/Ext/Module.bsl
// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт
	
	//CW_БухгалтерияЭкспедитора
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитора") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораСервер");
		Модуль_CW_БухгалтерияЭкспедитораСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
	КонецЕсли;  
	//CW_БухгалтерияЭкспедитора	   
	
	//CW_БухгалтерияЭкспедитораДляРоссии
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляРоссииСервер");
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
	КонецЕсли; 	 
	//CW_БухгалтерияЭкспедитораДляРоссии  
	
	//CW_БухгалтерияЭкспедитораДляБелоруси
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляБелорусиСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляБелорусиСервер");
		Модуль_CW_БухгалтерияЭкспедитораДляБелорусиСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
	КонецЕсли; 	 
	//CW_БухгалтерияЭкспедитораДляБелоруси   
	
	//CW_БухгалтерияЭкспедитораДляКазахстана
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляКазахстанаСервер");
		Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
	КонецЕсли; 	 
	//CW_БухгалтерияЭкспедитораДляКазахстана   
	
	//CW_БухгалтерияЭкспедитораДляУзбекистана
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляУзбекистанаСервер");
		Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);	
	КонецЕсли; 	 
	//CW_БухгалтерияЭкспедитораДляУзбекистана
	
КонецПроцедуры    

Функция РекомендуемаяВерсияБухгалтерияПредприятия() Экспорт
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляРоссииСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер.РекомендуемаяВерсияБухгалтерияПредприятия();	
	КонецЕсли;
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляКазахстанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер.РекомендуемаяВерсияБухгалтерияПредприятия();	
	КонецЕсли; 
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляБелорусиСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер.РекомендуемаяВерсияБухгалтерияПредприятия();	
	КонецЕсли;
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляУзбекистанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер.РекомендуемаяВерсияБухгалтерияПредприятия();	
	КонецЕсли;
	
КонецФункции  

// Функция - ИмяОсновнойПодсистемы
//   
// Определяет имя основной подсистемы по имению коря метаданых
//
// Возвращаемое значение:
//   -  ИмяОсновнойПодсистемы
//
Функция ИмяОсновнойПодсистемы() Экспорт
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляРоссииСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер.ИмяОсновнойПодсистемы();	
	КонецЕсли;
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляКазахстанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер.ИмяОсновнойПодсистемы();	
	КонецЕсли; 
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляБелорусиСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер.ИмяОсновнойПодсистемы();	
	КонецЕсли;
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляУзбекистанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер.ИмяОсновнойПодсистемы();	
	КонецЕсли;
	
КонецФункции

// Функция - Имя текущей конфигурации
// 
// Возвращает имя конфигурации для рабочего стола
//
Функция ИмяТекущейКонфигурации() Экспорт
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляРоссииСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер.ИмяТекущейКонфигурации();	
	КонецЕсли;
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляКазахстанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляКазахстанаСервер.ИмяТекущейКонфигурации();	
	КонецЕсли; 
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляБелорусиСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляБеларусиСервер.ИмяТекущейКонфигурации();	
	КонецЕсли;
	
	Если СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляУзбекистанаСервер");
		Возврат Модуль_CW_БухгалтерияЭкспедитораДляУзбекистанаСервер.ИмяТекущейКонфигурации();	
	КонецЕсли;

КонецФункции  

Функция СуществуетПодсистема(ИмяПодсистемы) Экспорт  
	
	ИменаПодсистем = CW_ВерсииПодсистемСерверПовтИсп.ИменаПодсистем();
	Возврат ИменаПодсистем.Получить(ИмяПодсистемы) <> Неопределено;
	
КонецФункции   

Функция ТребуетсяОбновлениеПодсистем() Экспорт
	
	УстановленныеПодсистемы		= УстановленныеВерсииПодсистем(); 

	ОписаниеПодсистем = Новый Структура;
	ПриДобавленииПодсистем(ОписаниеПодсистем); 
	
	Для Каждого КлючЗначение из ОписаниеПодсистем Цикл
		
		УстановленнаяВерсия = Неопределено;
		УстановленныеПодсистемы.Свойство(КлючЗначение.Ключ, УстановленнаяВерсия);
		
		Если УстановленнаяВерсия = Неопределено Тогда 
			//Подсистема не установлена, нужно запустить обновление
			Возврат Истина;	
		КонецЕсли;
		
		ТребуетсяОбновление = СравнитьВерсииПодсистем(УстановленнаяВерсия, КлючЗначение.Значение);    
		Если ТребуетсяОбновление Тогда
			Возврат Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции   

Функция ЭтоПервыйЗапуск() Экспорт
	
	УстановленнаяПодсистема = ОсновнаяПоставка();
	ИмяПодсистемы 			= ИмяОсновнойПодсистемы();  
	
	УстановленнаяВерсия = Неопределено;
	УстановленнаяПодсистема.Свойство(ИмяПодсистемы, УстановленнаяВерсия);
	
	Если УстановленнаяВерсия = Неопределено Или УстановленнаяВерсия = "0.0.0.0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
	

Функция СравнитьВерсииПодсистем(УстановленнаяВерсия, ТекущаяВерсия) Экспорт
	
	Если УстановленнаяВерсия = ТекущаяВерсия тогда
		Возврат Ложь; 
	КонецЕсли;
	
	мТекущаяВерсия 			= СтрРазделить(ТекущаяВерсия, ".");
	мУстановленнаяВерсия 	= СтрРазделить(УстановленнаяВерсия, ".");  
	
	Для Индекс = 0 по мТекущаяВерсия.ВГраница() Цикл
		РазрядТекущаяВерсия 		= Число(мТекущаяВерсия.Получить(Индекс));
		РазрядУстановленнаяВерсия 	= Число(мУстановленнаяВерсия.Получить(Индекс));
		
		Если РазрядУстановленнаяВерсия < РазрядТекущаяВерсия Тогда
			//Если разряд устанолвенной весрии меньше разряда текущей версии подсистемы, то возвращаем "Истина", требуется обновление
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции  

Функция УстановленныеВерсииПодсистем() Экспорт

	Подсистемы = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВерсииПодсистем.ИмяПодсистемы КАК ИмяПодсистемы,
	               |	CW_ВерсииПодсистем.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.CW_ВерсииПодсистем КАК CW_ВерсииПодсистем";
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Подсистемы.Вставить(Выборка.ИмяПодсистемы, Выборка.Версия);
	КонецЦикла;
	
	Возврат Подсистемы;
	
КонецФункции  

Функция ОсновнаяПоставка() Экспорт

	Подсистемы = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ВерсииПодсистем.ИмяПодсистемы КАК ИмяПодсистемы,
	               |	CW_ВерсииПодсистем.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.CW_ВерсииПодсистем КАК CW_ВерсииПодсистем
	               |ГДЕ
	               |	CW_ВерсииПодсистем.ОсновнаяПоставка = ИСТИНА";
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Подсистемы.Вставить(Выборка.ИмяПодсистемы, Выборка.Версия);
	КонецЦикла;
	
	Возврат Подсистемы;
	
КонецФункции


//Процедуры типовой конфигуарции
Функция ТекущаяВерсияБухгалтерияПредприятия() Экспорт
	
	ТекущаяВерсия = Неопределено;
	
	ВерсииПодсистем = ВерсииПодсистемБухгалтерияПредприятия();
	ВерсииПодсистем.Свойство(СокрЛП(Метаданные.Имя), ТекущаяВерсия);

	Возврат ?(ТекущаяВерсия = Неопределено, "0.0.0.0", ТекущаяВерсия);

КонецФункции   

Функция ВерсииПодсистемБухгалтерияПредприятия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВерсииПодсистем.ИмяПодсистемы КАК ИмяПодсистемы,
	               |	ВерсииПодсистем.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем";
	
	Результат = Запрос.Выполнить();
	
	Подсистемы = Новый Структура;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Подсистемы.Вставить(Выборка.ИмяПодсистемы, Выборка.Версия);
	КонецЦикла;
	
	Возврат Подсистемы;
	
КонецФункции   

Функция ПроверитьСоответствиеВерсийТиповойБухгалтерии() Экспорт
	
	РекомендуемаяВерсияБухгалтерии 	= РекомендуемаяВерсияБухгалтерияПредприятия();
	ТекущаяВерсияБухгалтерии 		= ТекущаяВерсияБухгалтерияПредприятия();
	
	РазделительРекомендуемая = Найти(РекомендуемаяВерсияБухгалтерии, ".");
	
	//  РазделительРекомендуемая = 0 - для последней цифры версии
	//-----------------------------------------------------------
	Пока РазделительРекомендуемая >= 0 Цикл
		СравниваемаяЦифраРекомендуемая = ?(РазделительРекомендуемая <> 0,Число(Лев(РекомендуемаяВерсияБухгалтерии, РазделительРекомендуемая - 1)),Число(РекомендуемаяВерсияБухгалтерии));		
		
		РазделительТекущая = Найти(ТекущаяВерсияБухгалтерии, ".");
		СравниваемаяЦифраТекущая = ?(РазделительТекущая <> 0,Число(Лев(ТекущаяВерсияБухгалтерии, РазделительТекущая - 1)),Число(ТекущаяВерсияБухгалтерии));
		
		Если СравниваемаяЦифраТекущая < СравниваемаяЦифраРекомендуемая Тогда
			Возврат Ложь;
		Иначе
			РекомендуемаяВерсияБухгалтерии = Прав(РекомендуемаяВерсияБухгалтерии, СтрДлина(РекомендуемаяВерсияБухгалтерии) - РазделительРекомендуемая);
			РазделительРекомендуемая = Найти(РекомендуемаяВерсияБухгалтерии, ".");
			
			ТекущаяВерсияБухгалтерии = Прав(ТекущаяВерсияБухгалтерии, СтрДлина(ТекущаяВерсияБухгалтерии) - РазделительТекущая);
			РазделительТекущая = Найти(ТекущаяВерсияБухгалтерии, ".");
			
		КонецЕсли; 
		Если РазделительРекомендуемая = 0 Тогда
			Прервать;
		КонецЕсли; 		
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции
//Процедуры типовой конфигуарции
